export const tree = [
  {
    'id': '1603600440002609153',
    'name': '能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2能力域2',
    'level': 1,
    'parentId': '1602573547807703042',
    'children': [
      {
        'id': '1603638951393099777',
        'name': '能力组1',
        'level': 2,
        'parentId': '1603600440002609153',
        'children': [
          {
            'id': '1603638964139589633',
            'name': '能力项23理',
            'level': 3,
            'parentId': '1603638951393099777'
          }]
      }, {
        'id': '1607557225629614082',
        'name': '能力组2',
        'level': 2,
        'parentId': '1603600440002609153'
      }
    ]
  },
  {
    'id': '1602599988385546242',
    'name': 'sdd',
    'level': 1,
    'parentId': '1602573547807703042',
    'children': [{
      'id': '1602864989830643713',
      'name': '能力组123',
      'level': 2,
      'parentId': '1602599988385546242',
      'children': [{
        'id': '1603592948786921474',
        'name': '能力项3 阿是劳动纠纷阿瑟分阿瑟分阿瑟发色而非阿瑟发色发阿瑟分',
        'level': 3,
        'parentId': '1602864989830643713'
      },
      {
        'id': '1603599015130431489',
        'name': '能力项2',
        'level': 3,
        'parentId': '1602864989830643713'
      }]
    }]
  },
  {
    'id': '1607990466119467009',
    'name': '1. 设计和编写Python程序',
    'level': 1,
    'parentId': '1602573547807703042',
    'children': [{
      'id': '1607990466438234113',
      'name': '1.1 构建和使用开发环境',
      'level': 2,
      'parentId': '1607990466119467009',
      'children': [{
        'id': '1607990466564063233',
        'name': '1.1.1 安装配置Python 3.x运行环境并管理包(使用Pip和Conda等工具)',
        'level': 3,
        'parentId': '1607990466438234113'
      },
      {
        'id': '1607990466694086658',
        'name': '1.1.2 使用Python开发工具(例如VSCode或PyCharm、Jupyter Lab等)编写、运行和调试程序',
        'level': 3,
        'parentId': '1607990466438234113'
      }]
    },
    {
      'id': '1607990466849275905',
      'name': '1.2 实现程序业务逻辑',
      'level': 2,
      'parentId': '1607990466119467009',
      'children': [{
        'id': '1607990466928967681',
        'name': '1.2.1 根据业务流程和规则，使用流程控制语句、函数、模块等编制应用程序',
        'level': 3,
        'parentId': '1607990466849275905'
      },
      {
        'id': '1607990466991882242',
        'name': '1.2.2 选择合适的数据类型和结构进行数据的存取(例如：tuple、list、set、dict等)',
        'level': 3,
        'parentId': '1607990466849275905'
      },
      {
        'id': '1607990467289677826',
        'name': '1.2.3 使用类、对象、继承等面向对象方法封装和扩展业务功能',
        'level': 3,
        'parentId': '1607990466849275905'
      },
      {
        'id': '1607990467553918977',
        'name': '1.2.4 通过合理的机制(例如异常处理、防御性编程等)增强程序的容错能力和健壮性',
        'level': 3,
        'parentId': '1607990466849275905'
      }]
    },
    {
      'id': '1607990467641999362',
      'name': '1.3 操作文件和目录',
      'level': 2,
      'parentId': '1607990466119467009',
      'children': [{
        'id': '1607990468266950657',
        'name': '1.3.1 使用file对象读写文本文件和二进制文件',
        'level': 3,
        'parentId': '1607990467641999362'
      },
      {
        'id': '1607990468396974082',
        'name': '1.3.2 使用os模块对目录和文件进行操作(例如：创建目录、遍历文件和子目录、复制、更名等)',
        'level': 3,
        'parentId': '1607990467641999362'
      }]
    },
    {
      'id': '1607990468480860161',
      'name': '1.4 执行科学计算',
      'level': 2,
      'parentId': '1607990466119467009',
      'children': [{
        'id': '1607990468606689281',
        'name': '1.4.1 灵活使用numpy.array对象进行数值数组的操作(例如：创建、修改、删除、增加、合并、拆分、切片、筛选等)',
        'level': 3,
        'parentId': '1607990468480860161'
      },
      {
        'id': '1607990468694769666',
        'name': '1.4.2 熟练使用math模块和numpy模块中的常见数学计算函数(例如：基本数学计算、三角函数、随机数等)',
        'level': 3,
        'parentId': '1607990468480860161'
      }]
    }]
  },
  {
    'id': '1607990468808015873',
    'name': '2．采集、处理和统计数据',
    'level': 1,
    'parentId': '1602573547807703042',
    'children': [{
      'id': '1607990468866736130',
      'name': '2.1 采集和提取数据',
      'level': 2,
      'parentId': '1607990468808015873',
      'children': [{
        'id': '1607990468925456385',
        'name': '2.1.1 使用合适的包从格式化文件(例如：csv、xml、json、excel等)中读写数据',
        'level': 3,
        'parentId': '1607990468866736130'
      },
      {
        'id': '1607990468979982338',
        'name': '2.1.2 使用合适的包(例如pymysql)从关系型数据库(例如MySQL)中查询和修改数据',
        'level': 3,
        'parentId': '1607990468866736130'
      },
      {
        'id': '1607990469068062721',
        'name': '2.1.3 使用urilib模块或爬虫框架(例如Scrapy)爬取一个或多个网页的数据并提取有效信息',
        'level': 3,
        'parentId': '1607990468866736130'
      }]
    },
    {
      'id': '1607990469114200066',
      'name': '2.2 统计数据特征',
      'level': 2,
      'parentId': '1607990468808015873',
      'children': [{
        'id': '1607990469193891841',
        'name': '2.2.1 使用Pandas的DataFrame和Series进行数据操作(例如：创建、修改、删除、增加、合并、拆分、切片、筛选、数据类型转换等)',
        'level': 3,
        'parentId': '1607990469114200066'
      },
      {
        'id': '1607990469416189954',
        'name': '2.2.2 使用自定义或调用包函数的方式获取数据的统计和分布情况(例如：计数、求和、均值、极值、百分位数、方差、标准差、协方差、相关性、异常点/离群点检测、正态性验证)',
        'level': 3,
        'parentId': '1607990469114200066'
      }]
    },
    {
      'id': '1607990469458132993',
      'name': '2.3 展示数据',
      'level': 2,
      'parentId': '1607990468808015873',
      'children': [{
        'id': '1607990469504270337',
        'name': '2.3.1 使用合适的绘图包(例如：matplotlib、seaborn等)绘制图像(例如：散点图、折线图、柱状图、饼图、箱图、误差图、直方图、热力图等)，并设置图像属性(例如：尺寸、标签、图例、刻度和颜色等)',
        'level': 3,
        'parentId': '1607990469458132993'
      },
      {
        'id': '1607990469550407681',
        'name': '2.3.2 使用合适的绘图包(例如：PyEcharts等)绘制复杂图像(例如：时序动画、地理信息图像、3D图像等)',
        'level': 3,
        'parentId': '1607990469458132993'
      }]
    },
    {
      'id': '1607990469592350722',
      'name': '2.4 执行预处理操作',
      'level': 2,
      'parentId': '1607990468808015873',
      'children': [{
        'id': '1607990469697208322',
        'name': '2.4.1 使用多种方式对数据进行抽样或子集划分(例如：等距抽样、分层抽样、整群抽样、随机拆分、生成K折交叉子集等)',
        'level': 3,
        'parentId': '1607990469592350722'
      },
      {
        'id': '1607990469747539970',
        'name': '2.4.2 识别数据中的缺失值、重复值并采用多种方法(例如：删除法、平均值填补、临近值填补、众数填补法等)进行填充或删除',
        'level': 3,
        'parentId': '1607990469592350722'
      }]
    }]
  }
];

export const tree2 = [
  {
    id: 1,
    name: 'Level one 1',
    children: [
      {
        id: 4,
        name: 'Level two 1-1',
        children: [
          {
            id: 9,
            name: 'Level three 1-1-1'
          },
          {
            id: 10,
            name: 'Level three 1-1-2'
          }
        ]
      }
    ]
  },
  {
    id: 2,
    name: 'Level one 2',
    children: [
      {
        id: 5,
        name: 'Level two 2-1'
      },
      {
        id: 6,
        name: 'Level two 2-2'
      }
    ]
  },
  {
    id: 3,
    name: 'Level one 3',
    children: [
      {
        id: 7,
        name: 'Level two 3-1'
      },
      {
        id: 8,
        name: 'Level two 3-2'
      }
    ]
  }
];
